# Data Cleaning process

In [1]:
import pandas as pd

In [2]:
billionaires_data = pd.read_csv('datasets/billionaires_data_2022.csv')

In [4]:
billionaires_data.head(10)

,rank,person_name,age,country,net_worth(billion $),category,source
0,1,Elon Musk,50,United States,$219 B,Automotive,"Tesla, SpaceX"
1,2,Jeff Bezos,58,United States,$171 B,Technology,Amazon
2,3,Bernard Arnault & family,73,France,$158 B,Fashion & Retail,LVMH
3,4,Bill Gates,66,United States,$129 B,Technology,Microsoft
4,5,Warren Buffett,91,United States,$118 B,Finance & Investments,Berkshire Hathaway
5,6,Larry Page,49,United States,$111 B,Technology,Google
6,7,Sergey Brin,48,United States,$107 B,Technology,Google
7,8,Larry Ellison,77,United States,$106 B,Technology,software
8,9,Steve Ballmer,66,United States,$91.4 B,Technology,Microsoft
9,10,Mukesh Ambani,64,India,$90.7 B,Diversified,diversified

In [7]:
billionaires_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2668 entries, 0 to 2667
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   rank                  2668 non-null   int64
 1   person_name           2668 non-null   object
 2   age                   2668 non-null   int64
 3   country               2655 non-null   object
 4   net_worth(billion $)  2668 non-null   object
 5   category              2668 non-null   object
 6   source                2668 non-null   object
dtypes: int64(2), object(5)
memory usage: 146.0+ KB

In [9]:
# Checking if there's duplicated data
billionaires_data[billionaires_data.duplicated() == True]

Empty DataFrame
Columns: [rank, person_name, age, country, net_worth(billion $), category, source]
Index: []

In [11]:
## Checks the missing values
billionaires_data.isnull()

,rank,person_name,age,country,net_worth(billion $),category,source
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
2663,False,False,False,False,False,False,False
2664,False,False,False,False,False,False,False
2665,False,False,False,False,False,False,False
2666,False,False,False,False,False,False,False
2667,False,False,False,False,False,False,False

In [19]:
# Now let's get a Pandas Serie that contains the indexes of missing values in a row
rows_with_missing_values = billionaires_data.isnull().any(axis =1)

In [20]:
billionaires_data[rows_with_missing_values]

,rank,person_name,age,country,net_worth(billion $),category,source
164,163,Zhang Congyuan,74,NaN,$11.7 B,Fashion & Retail,shoes
1102,1096,Karen Virginia Beckmann Legoretta,52,NaN,$2.8 B,Food & Beverage,tequila
1282,1238,Christiane Schoeller,0,NaN,$2.5 B,Media & Entertainment,publishing
1311,1292,Kevin David Lehmann,19,NaN,$2.4 B,Fashion & Retail,drugstores
1661,1645,Philip Fayer,0,NaN,$1.8 B,Finance & Investments,online payments
1733,1729,Alex Birkenstock,53,NaN,$1.7 B,Fashion & Retail,shoes
1787,1729,Renate Sick-Glaser,0,NaN,$1.7 B,Technology,sensor technology
2090,2076,Cho Jyh-jer,0,NaN,$1.4 B,Technology,semiconductors
2394,2324,Ulrich Mommert & family,81,NaN,$1.2 B,Automotive,lighting
2442,2324,Yeh Kuo-I,80,NaN,$1.2 B,Manufacturing,manufacturing
2562,2448,Franziska Wuerbser,34,NaN,$1.1 B,Manufacturing,kitchen appliances
2640,2578,Stephan Schnabel,0,NaN,$1 B,Manufacturing,chemicals

We see that there are some billionaires without country
In this case there are not many persons with missing countries
We can fill it manually

In [17]:
# Guillaume Pousaz country is Switzerland
# Let's fill it
billionaires_data.at[65,'country'] = 'Switzerland'

In [18]:
billionaires_data.iloc[65]

rank                                       66
person_name                  Guillaume Pousaz
age                                        40
country                           Switzerland
net_worth(billion $)                    $23 B
category                Finance & Investments
source                                fintech
Name: 65, dtype: object

In [57]:
# Let's do the same for the others
#billionaires_data[billionaires_data.country=='Taiwan']

In [60]:
billionaires_data.at[2562,'country'] = 'Germany'
#billionaires_data.at[1787,'age'] = 74
billionaires_data.iloc[2562]

rank                                  2448
person_name             Franziska Wuerbser
age                                     34
country                            Germany
net_worth(billion $)                $1.1 B
category                     Manufacturing
source                  kitchen appliances
Name: 2562, dtype: object

In [61]:
rows_with_missing_values = billionaires_data.isnull().any(axis =1)
billionaires_data[rows_with_missing_values]

,rank,person_name,age,country,net_worth(billion $),category,source
2090,2076,Cho Jyh-jer,0,NaN,$1.4 B,Technology,semiconductors
2640,2578,Stephan Schnabel,0,NaN,$1 B,Manufacturing,chemicals

In [62]:
## Only two persons remains. Unfortunately we don't have information about their age and country
## So let's delete them from our data
billionaires_data.drop([2090,2640], inplace=True)

In [65]:
rows_with_missing_values = billionaires_data.isnull().any(axis =1)
billionaires_data[rows_with_missing_values]

Empty DataFrame
Columns: [rank, person_name, age, country, net_worth(billion $), category, source]
Index: []

#### Let's now check the age column

In [72]:
index_of_null_ages = billionaires_data[billionaires_data.age == 0].any(axis=1).index

In [75]:
index_of_null_ages

Int64Index([  34,  107,  132,  147,  212,  229,  245,  260,  283,  303,  309,
             429,  482,  571,  578,  590,  652,  678,  687,  720,  756,  765,
             770,  782,  870,  917,  953, 1029, 1036, 1050, 1075, 1126, 1154,
            1195, 1237, 1239, 1243, 1250, 1281, 1383, 1444, 1587, 1610, 1651,
            1680, 1693, 1741, 1764, 1770, 1835, 1903, 1910, 1960, 2014, 2015,
            2028, 2067, 2070, 2123, 2124, 2159, 2172, 2321, 2322, 2337, 2338,
            2463, 2472, 2475, 2476, 2479, 2494, 2495, 2517, 2518, 2528, 2537,
            2554, 2556, 2572],
           dtype='int64')

In [73]:
# We have 80 billionaires with an unknown age 
# A suitable solution is to drop them because we will need the age in our analysis process
# Let's first copy our data
billionaires_data_cleaned = billionaires_data.copy()

In [76]:
# Let's now use the copy for deleting the rows with null ages
billionaires_data_cleaned.drop(index_of_null_ages, inplace=True)

In [77]:
# Let's check if the deletion is done properly
billionaires_data_cleaned[billionaires_data_cleaned.age == 0]

Empty DataFrame
Columns: [rank, person_name, age, country, net_worth(billion $), category, source]
Index: []

#### Let's now check the person_name and net_worth columns

In [84]:
billionaires_data_cleaned.columns

Index(['rank', 'person_name', 'age', 'country', 'net_worth(billion $)',
       'category', 'source'],
      dtype='object')

In [85]:
# Let's rename the column "person_name" to "name"
billionaires_data_cleaned.rename(columns={
    'person_name':'name',
    'net_worth(billion $)':'net_worth_billion_dollars'
}, inplace=True)

In [88]:
billionaires_data_cleaned.head(10)

,rank,name,age,country,net_worth_billion_dollars,category,source
0,1,Elon Musk,50,United States,$219 B,Automotive,"Tesla, SpaceX"
1,2,Jeff Bezos,58,United States,$171 B,Technology,Amazon
2,3,Bernard Arnault & family,73,France,$158 B,Fashion & Retail,LVMH
3,4,Bill Gates,66,United States,$129 B,Technology,Microsoft
4,5,Warren Buffett,91,United States,$118 B,Finance & Investments,Berkshire Hathaway
5,6,Larry Page,49,United States,$111 B,Technology,Google
6,7,Sergey Brin,48,United States,$107 B,Technology,Google
7,8,Larry Ellison,77,United States,$106 B,Technology,software
8,9,Steve Ballmer,66,United States,$91.4 B,Technology,Microsoft
9,10,Mukesh Ambani,64,India,$90.7 B,Diversified,diversified

In [94]:
# A simple function to transform the networth
def transform_string(string):
    return string.replace(' B','').replace('$','')

In [100]:
# Let's now clean the net_worth_billion_dollars column and convert it to a numeric
billionaires_data_cleaned['net_worth_billion_dollars']=billionaires_data_cleaned['net_worth_billion_dollars'].apply(transform_string)
billionaires_data_cleaned.head(10)

,rank,name,age,country,net_worth_billion_dollars,category,source
0,1,Elon Musk,50,United States,219,Automotive,"Tesla, SpaceX"
1,2,Jeff Bezos,58,United States,171,Technology,Amazon
2,3,Bernard Arnault & family,73,France,158,Fashion & Retail,LVMH
3,4,Bill Gates,66,United States,129,Technology,Microsoft
4,5,Warren Buffett,91,United States,118,Finance & Investments,Berkshire Hathaway
5,6,Larry Page,49,United States,111,Technology,Google
6,7,Sergey Brin,48,United States,107,Technology,Google
7,8,Larry Ellison,77,United States,106,Technology,software
8,9,Steve Ballmer,66,United States,91.4,Technology,Microsoft
9,10,Mukesh Ambani,64,India,90.7,Diversified,diversified

In [106]:
# Now that the column net_worth_billion_dollars values are transformed we can convert them to numeric
billionaires_data_cleaned['net_worth_billion_dollars'] = billionaires_data_cleaned['net_worth_billion_dollars'].astype(float)
billionaires_data_cleaned.head(10)

,rank,name,age,country,net_worth_billion_dollars,category,source
0,1,Elon Musk,50,United States,219.0,Automotive,"Tesla, SpaceX"
1,2,Jeff Bezos,58,United States,171.0,Technology,Amazon
2,3,Bernard Arnault & family,73,France,158.0,Fashion & Retail,LVMH
3,4,Bill Gates,66,United States,129.0,Technology,Microsoft
4,5,Warren Buffett,91,United States,118.0,Finance & Investments,Berkshire Hathaway
5,6,Larry Page,49,United States,111.0,Technology,Google
6,7,Sergey Brin,48,United States,107.0,Technology,Google
7,8,Larry Ellison,77,United States,106.0,Technology,software
8,9,Steve Ballmer,66,United States,91.4,Technology,Microsoft
9,10,Mukesh Ambani,64,India,90.7,Diversified,diversified

In [107]:
# Let's see if the type has changed
billionaires_data_cleaned.dtypes

rank                           int64
name                          object
age                            int64
country                       object
net_worth_billion_dollars    float64
category                      object
source                        object
dtype: object

In [114]:
# Let's explore the category column
billionaires_data_cleaned.category.unique()

array(['Automotive', 'Technology', 'Fashion & Retail',
       'Finance & Investments', 'Diversified', 'Media & Entertainment',
       'Telecom', 'Food & Beverage', 'Logistics', 'Real Estate',
       'Metals & Mining', 'Manufacturing', 'Gambling & Casinos',
       'Healthcare', 'Service', 'Energy', 'Construction & Engineering',
       'Sports'], dtype=object)

In [118]:
# Let's explore the country column
billionaires_data_cleaned.country.unique()

array(['United States', 'France', 'India', 'Mexico', 'China',
       'United Arab Emirates', 'Spain', 'Canada', 'Germany',
       'Switzerland', 'Belgium', 'Hong Kong', 'United Kingdom',
       'Australia', 'Austria', 'Italy', 'Japan', 'Bahamas', 'Indonesia',
       'Chile', 'Russia', 'Sweden', 'Czechia', 'Monaco', 'Nigeria',
       'Denmark', 'Thailand', 'Singapore', 'Taiwan', 'Malaysia', 'Brazil',
       'Colombia', 'New Zealand', 'South Korea', 'South Africa',
       'Philippines', 'Egypt', 'Israel', 'Vietnam', 'Poland', 'Norway',
       'Cayman Islands', 'Netherlands', 'Eswatini (Swaziland)', 'Peru',
       'Algeria', 'Kazakhstan', 'Georgia', 'Portugal',
       'British Virgin Islands', 'Turkey', 'Finland', 'Ukraine', 'Cyprus',
       'Ireland', 'Bermuda', 'Lebanon', 'Argentina', 'Cambodia', 'Oman',
       'Guernsey', 'Liechtenstein', 'Turks and Caicos Islands', 'Qatar',
       'Morocco', 'Uruguay', 'Slovakia', 'Romania', 'Nepal', 'Tanzania',
       'Bahrain', 'Greece', 'Hungary', 'Andorra'], dtype=object)

In [ ]:
# Let's change Estawini to Swaziland
idx = billionaires_data_cleaned[billionaires_data_cleaned.country == 'Eswatini (Swaziland)'].index.values[0]
billionaires_data_cleaned.at[idx,'country'] = 'Swaziland'

In [132]:
billionaires_data_cleaned[billionaires_data_cleaned.country == 'Swaziland']

,rank,name,age,country,net_worth_billion_dollars,category,source
513,509,Nathan Kirsh,90,Swaziland,5.3,Fashion & Retail,"retail, real estate"

In [133]:
billionaires_data_cleaned.country.unique()

array(['United States', 'France', 'India', 'Mexico', 'China',
       'United Arab Emirates', 'Spain', 'Canada', 'Germany',
       'Switzerland', 'Belgium', 'Hong Kong', 'United Kingdom',
       'Australia', 'Austria', 'Italy', 'Japan', 'Bahamas', 'Indonesia',
       'Chile', 'Russia', 'Sweden', 'Czechia', 'Monaco', 'Nigeria',
       'Denmark', 'Thailand', 'Singapore', 'Taiwan', 'Malaysia', 'Brazil',
       'Colombia', 'New Zealand', 'South Korea', 'South Africa',
       'Philippines', 'Egypt', 'Israel', 'Vietnam', 'Poland', 'Norway',
       'Cayman Islands', 'Netherlands', 'Swaziland', 'Peru', 'Algeria',
       'Kazakhstan', 'Georgia', 'Portugal', 'British Virgin Islands',
       'Turkey', 'Finland', 'Ukraine', 'Cyprus', 'Ireland', 'Bermuda',
       'Lebanon', 'Argentina', 'Cambodia', 'Oman', 'Guernsey',
       'Liechtenstein', 'Turks and Caicos Islands', 'Qatar', 'Morocco',
       'Uruguay', 'Slovakia', 'Romania', 'Nepal', 'Tanzania', 'Bahrain',
       'Greece', 'Hungary', 'Andorra'], dtype=object)

In [134]:
# Now we're done with data cleaning. We can save the cleaned data as csv file in the datasets folder
billionaires_data_cleaned.to_csv('datasets/billionaires_cleaned_data_2022.csv',index=False)